# Pandas 101 - Part I

In [119]:
import pandas as pd
import numpy as np
from numpy.random import randint

In [120]:
np.random.seed(1) # This is to make sure that we always get the same number

In [121]:
df = pd.DataFrame(randint(1000, size=(5,4)), ["A", "B", "C", "D", "E"], ["W", "X", "Y", "Z"])
df

     W    X    Y    Z
A   37  235  908   72
B  767  905  715  645
C  847  960  144  129
D  972  583  749  508
E  390  281  178  276

In [122]:
df["W"]

A     37
B    767
C    847
D    972
E    390
Name: W, dtype: int64

In [123]:
type(df["W"])

pandas.core.series.Series

In [124]:
type(df)

pandas.core.frame.DataFrame

In [125]:
df.shape

(5, 4)

## Retrieving Data

- ### Retrieve all the data in the column

In [126]:
df["X"]

A    235
B    905
C    960
D    583
E    281
Name: X, dtype: int64

- ### Retrieve all the data from multiple columns

In [127]:
df[["W", "Y"]]

     W    Y
A   37  908
B  767  715
C  847  144
D  972  749
E  390  178

## Adding New Column

In [128]:
df["New"] = df["W"] + df["Y"]
df

     W    X    Y    Z   New
A   37  235  908   72   945
B  767  905  715  645  1482
C  847  960  144  129   991
D  972  583  749  508  1721
E  390  281  178  276   568

## Removing Column

- ### Non-Permanent

In [129]:
df.drop("New", axis=1)

     W    X    Y    Z
A   37  235  908   72
B  767  905  715  645
C  847  960  144  129
D  972  583  749  508
E  390  281  178  276

In [130]:
df

     W    X    Y    Z   New
A   37  235  908   72   945
B  767  905  715  645  1482
C  847  960  144  129   991
D  972  583  749  508  1721
E  390  281  178  276   568

- ### Permanent

In [131]:
df.drop("New", axis=1, inplace=True)

In [132]:
df

     W    X    Y    Z
A   37  235  908   72
B  767  905  715  645
C  847  960  144  129
D  972  583  749  508
E  390  281  178  276

## Removing Rows

- ### Non-Permanent

In [133]:
df.drop("E", axis=0)

     W    X    Y    Z
A   37  235  908   72
B  767  905  715  645
C  847  960  144  129
D  972  583  749  508

In [134]:
df

     W    X    Y    Z
A   37  235  908   72
B  767  905  715  645
C  847  960  144  129
D  972  583  749  508
E  390  281  178  276

- ### Permanent

In [135]:
df.drop("E", axis=0, inplace=True)

In [136]:
df

     W    X    Y    Z
A   37  235  908   72
B  767  905  715  645
C  847  960  144  129
D  972  583  749  508

## Manipulation of Row Level Data

### Using of ***loc***

- #### Get data based on Row Label

In [137]:
df.loc["A"]

W     37
X    235
Y    908
Z     72
Name: A, dtype: int64

- #### Get data based on Row and Column Label

In [140]:
df.loc["B","X"]

905

### Using of ***iloc***

- #### Get data based on Row Index

In [139]:
df.iloc[0]

W     37
X    235
Y    908
Z     72
Name: A, dtype: int64

- #### Get data based on Row and Column Index

In [143]:
df.iloc[1,1]

905